app/controllers/posts_controller.rb

  def create
    @post = Post.create params[:post].permit(:title, :content)
---
INSERT INTO "posts" ("content", "created_at", "title", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "This is amazing post content"], ["created_at", "2014-01-24 12:01:14.266520"], ["title", "Amazing post"], ["updated_at", "2014-01-24 12:01:14.266520"]]